# 09: Membagi Data Frame menjadi dua secara acak

### Import Modules

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame

In [4]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
df

    A   B   C   D   E
0  10   1  14   7  13
1   7   5   4   2  10
2   8  13   2  16   6
3  13  15   8  10   8
4  16  17   2  14   5
5  14  14   9  18  19
6  19   1  15  19  19
7   1  11   5  17   5
8  13  10  10   9  18
9   8   2  16   5   5

### Membagi Data Frame menjadi dua secara acak berdasarkan propoorsi tertentu

In [5]:
df.shape

(10, 5)

In [6]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1_shape: {df_1.shape}')
print(f'df_2_shape: {df_2.shape}')

df_1_shape: (7, 5)
df_2_shape: (3, 5)

In [ ]:
# df.sample = method yang akan mengambil baris secara acar sejumlah 70%(berdasarkan proporsi) dari baris-baris yang dimiliki df
# hasilnya akan dibentuk dalam df baru
# lalu df kedua akan di drop dari df aslinya berdasarkan baris-baris yang sudah diadopsi dari df_1

In [7]:
df_1

    A   B   C   D   E
1   7   5   4   2  10
4  16  17   2  14   5
6  19   1  15  19  19
3  13  15   8  10   8
7   1  11   5  17   5
8  13  10  10   9  18
0  10   1  14   7  13

In [8]:
df_2

    A   B   C   D   E
2   8  13   2  16   6
5  14  14   9  18  19
9   8   2  16   5   5